app/views/frame/historial.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 10 ORDER BY `users`.`id` ASC LIMIT 1
---
										<td> <%= current_user.firstName %> </td>
										<td> <%=transaccion.offer.user.firstName %> </td>