app/controllers/frame_controller.rb

SELECT  `offers`.* FROM `offers` LIMIT 11
---
  def verOfertas
     @id_notif = params[:id_notif]
     @nom_notif = params[:nom_notif]
     @ofer_notif = params[:ofer_notif]
     @cate = params[:cate]
     @userRequest = Request.where(:user_id => current_user.id).first
     @ver_oferta_categoria = Offer.where(:category_id =>@cate).reverse
     @ver_oferta_todas = Offer.where.not(:user_id => current_user.id).reverse