app/controllers/frame_controller.rb

  def categorias
    @categories = Category.all
---
SELECT `categories`.* FROM `categories`

  def verOfertas
     @cate = params[:cate]
     @offer_categories = OfertCategory.where(:idCategoria => @cate)
     @ver_oferta = Offer.all
---
SELECT `ofert_categories`.* FROM `ofert_categories` WHERE `ofert_categories`.`idCategoria` IS NULL
SELECT `offers`.* FROM `offers`