app/controllers/offers_controller.rb

  def index
    search = params[:term].present? ? params[:term] : nil
    @offers = if search
                Offer.search(search, where: { user_id: { not: current_user.id }})
---
SELECT `offers`.* FROM `offers`

  def show
    @contract_o = Contract.where(offer_id: @offer_c)

    @oferta_solicitada = Offer.where(id: @offerta_id)

    @user_ofertante = Contract.where(id: @contract_o)
    @oferta_completa = Offer.where(id: @offer_cliente)
    @userRequestOffer = Request.where(user_id = (current_user.id).to_s)
    @userRequest = Request.where(:user_id => current_user.id)
    @user_cliente = Contract.where(user_id: current_user)
    @user = params[:users]
    @ver_perfil_publico = User.where(:id => @user)
---
SELECT  `offers`.* FROM `offers` WHERE `offers`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

  def create
    @offer = current_user.offers.new(offer_params)

    respond_to do |format|
      if @offer.save
---
INSERT INTO `offers` (`nombre`, `descripcion`, `imagen`, `user_id`, `created_at`, `updated_at`) VALUES ('Camilo', 'asd', 'asd', 1, '2017-10-08 06:12:41', '2017-10-08 06:12:41')